jwt_auth/src/InformationRegisters/НазначенияОбластейДоступа/НазначенияОбластейДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НазначенияОбластейДоступа</name>
  <resources>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Область</name>
    <type>
      <types>CatalogRef.ОбластиДоступа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

jwt_auth/src/InformationRegisters/НазначенияОбластейДоступа/ManagerModule.bsl
Функция ОбластиПоПользователю(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбластиДоступа.Область.Идентификатор КАК Область
		|ИЗ
		|	РегистрСведений.НазначенияОбластейДоступа КАК ОбластиДоступа
		|ГДЕ
		|	ОбластиДоступа.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Области = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Области.Добавить(Выборка.Область);
	КонецЦикла;
	
	Возврат Области;
	
КонецФункции
